; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	infrared1 - mode
	thermograph4 - mode
	spectrograph3 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph4)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star3)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
)
(:goal (and
	(have_image Planet5 thermograph4)
	(have_image Planet6 spectrograph3)
	(have_image Star7 thermograph4)
	(have_image Planet8 infrared0)
	(have_image Phenomenon9 infrared1)
	(have_image Phenomenon10 infrared1)
	(have_image Planet11 infrared0)
	(have_image Planet12 thermograph4)
	(have_image Planet13 spectrograph3)
))

)

; plan
1. (turn_to satellite0 star3 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star3)
   goals met: 0 of 9
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite0 phenomenon9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 9
5. (take_image satellite0 phenomenon9 instrument2 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon10 instrument2 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 2 of 9
8. (turn_to satellite0 star3 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star3)
   goals met: 2 of 9
9. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 2 of 9
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
11. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 2 of 9
12. (turn_to satellite0 planet11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet11)
   goals met: 2 of 9
13. (take_image satellite0 planet11 instrument0 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 3 of 9
14. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 3 of 9
15. (take_image satellite0 planet12 instrument0 thermograph4)
   added: (have_image planet12 thermograph4)
   goals met: 4 of 9
16. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 4 of 9
17. (take_image satellite0 planet13 instrument0 spectrograph3)
   added: (have_image planet13 spectrograph3)
   goals met: 5 of 9
18. (turn_to satellite0 planet5 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet5)
   goals met: 5 of 9
19. (take_image satellite0 planet5 instrument0 thermograph4)
   added: (have_image planet5 thermograph4)
   goals met: 6 of 9
20. (turn_to satellite0 planet6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet6)
   goals met: 6 of 9
21. (take_image satellite0 planet6 instrument0 spectrograph3)
   added: (have_image planet6 spectrograph3)
   goals met: 7 of 9
22. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 7 of 9
23. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 8 of 9
24. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 8 of 9
25. (take_image satellite0 star7 instrument0 thermograph4)
   added: (have_image star7 thermograph4)
   goals met: 9 of 9
